//=============================================================================
//
// ファン処理 [fan.cpp]
// Author : 羽鳥太一
//
//=============================================================================
//=============================================================================
// インクルード
//=============================================================================
#include "fan.h"
#include "player.h"
#include "model_single.h"

//=============================================================================
// マクロ定義
//=============================================================================
#define FAN_JUMP_POW		(30.0f)		// ジャンプ力
#define FAN_FORWORD_POW		(10.0f)		// 進力

//=============================================================================
// デフォルトコンストラクタ
//=============================================================================
CFan::CFan(CObject::PRIORITY Priority) : CHappenig(Priority)
{

}

//=============================================================================
// デフォルトデストラクタ
//=============================================================================
CFan::~CFan()
{

}

//=============================================================================
// 初期化
//=============================================================================
HRESULT CFan::Init(void)
{
	CHappenig::Init();
	CHappenig::SetModel(CModelSingle::Create(m_pos, m_rot, CXload::X_TYPE_FAN, NULL, true));
	CObject::SetObjType(CObject::OBJTYPE::FAN);

	return S_OK;
}

//=============================================================================
// 終了
//=============================================================================
void CFan::Uninit(void)
{
	CHappenig::Uninit();
}

//=============================================================================
// 更新
//=============================================================================
void CFan::Update(void)
{
	CHappenig::Update();
	if (CHappenig::HitPlayer() == true)
	{
		//オブジェクト情報を入れるポインタ
		vector<CObject*> object;

		//先頭のポインタを代入
		object = CObject::GetObject(static_cast<int>(CObject::PRIORITY::PLAYER));
		int object_size = object.size();

		for (int count_object = 0; count_object < object_size; count_object++)
		{
			//プレイヤーだった時
			if (object[count_object]->GetObjType() == CObject::OBJTYPE::PLAYER)
			{
				CPlayer *player = static_cast<CPlayer*>(object[count_object]);

				player->SetJump(FAN_JUMP_POW);
				player->SetMoveForward(FAN_FORWORD_POW);
			}
		}
	}
}

//=============================================================================
// 描画
//=============================================================================
void CFan::Draw(void)
{
	CHappenig::Draw();
}

//=============================================================================
// 生成処理
//=============================================================================
CFan *CFan::Create(const D3DXVECTOR3 &pos, const D3DXVECTOR3 &rot)
{
	CFan *fan = nullptr;
	if (fan == nullptr)
	{
		fan = new CFan;
		if (fan != nullptr)
		{
			fan->m_pos = pos;
			fan->m_rot = rot;
			fan->Init();
		}
	}
	return fan;
}