//================================================
//プレイデータ管理処理
//Author:加藤瑞葵
//================================================
#include "play_data.h"
#include "model_single.h"

//================================================
//静的メンバ変数宣言
//================================================

//================================================
//デフォルトコンストラクタ
//================================================
CPlayData::CPlayData()
{	
	m_nScore = 0;
	m_pScore = nullptr;
	m_nTime = 0;
	for (int count_happening = 0; count_happening < (int)CModelSingle::HAPPENING_TYPE::MAX - 1; count_happening++)
	{
		bool flag = false;

		m_trophy_flag.push_back(flag);
	}
}

//================================================
//デストラクタ
//================================================
CPlayData::~CPlayData()
{

}

//================================================
//初期化処理
//================================================
HRESULT CPlayData::Init(void)
{
	m_nScore = 0;
	m_pScore = nullptr;
	m_nTime = 0;

	return S_OK;
}

//================================================
//終了処理
//================================================
void CPlayData::Uninit(void)
{
	
}
