//=============================================================================
//
// トロフィールーム処理 [trophy.h]
// Author : 羽鳥太一
//
//=============================================================================
#ifndef _TROPHY_H_
#define _TROPHY_H_

//*****************************************************************************
// ヘッダファイルのインクルード
//*****************************************************************************
#include "object.h"

//*****************************************************************************
// 前方宣言
//*****************************************************************************
class CObject2D;

//*****************************************************************************
// クラス定義
//*****************************************************************************
class CTrophy : public CObject
{
public:
	//---------------------------
	// 列挙型
	//---------------------------
	enum class TROPHY
	{
		AIRPLANE = 0,	// 飛行機
		FAN,			// 扇風機
		REDBULL,		// レッドブル
		STARRING,		// スターリング
		THORN,			// とげ
		ROCKET,			// ロケット
		BANANA,			// バナナ
		TRAMPOLINE,		// トランポリン
		M_1000,			// 1000m
		M_5000,			// 5000m
		M_10000,		// 10000m
		MEASUREMENT_IMPOSSIBLE,	// 測定不能
		EVENING,		// 夕方
		NIGHT,			// 夜
		GIRL,			// ロキ子
		HARD,			// ハード
		GROUND,			// 地面
		PLAY_00,		// 初プレイ
		PLAY_05,		// 5プレイ
		PLAY_10,		// 10プレイ
		ENDROLL,		// エンドロール
		ROCKY_ANGRY,	// ロッキーくん怒る
		KIYO,			// キヨのブレーキ音
		COMPLETE,		// コンプリート
		MAX				// 最大数
	};

	CTrophy(PRIORITY priorty = PRIORITY::NONE);	// デフォルトコンストラクタ
	~CTrophy();	// デフォルトデストラクタ
	HRESULT Init(void);	// 初期化
	void Uninit(void);	// 終了
	void Update(void);	// 更新
	void Draw(void);	// 描画

private:
	CObject2D* m_buck;	// 戻るボタン
	CObject2D *m_letter;	// 説明ポリゴン
	vector<CObject2D*> m_icon;	// アイコン
	vector<TROPHY> m_type;	// 何のトロフィーか
	int m_count_get_trophy;	// trueのトロフィー数
};

#endif // !_TROPHY_H_